package ru.job4j;
/*
* Исходный код файла можно разбить на две области: заголовок и тело.
* Заголовок указывается первой строчкой в файле. Он должен быть всегда.
* Заголовок начинается с ключевого слова "package".
* Далее идет тело исходного кода. Оно начинается со строчек "public class".
* В Java есть соглашение, что файл с кодом должен иметь такое же имя, как и имя блока тела кода (Main.java - public class Main).
* Также есть соглашение, что имя файла и имя класса должны начинаться с заглавной буквы.
* Термин "Класс" - это группа операторов, которая выполняет одну задачу.
* Код, описывающий работу этого класса, называется телом класса и его необходимо писать в фигурных скобках.
* Внутри самого класса код разбивается на подгруппы операторов - методы.
* Метод main является особым, потому что Java выполняет нашу программу с операторов, которые написаны  внутри этого метода.
* Самым простым элементом программы является оператор. Оператор - это неделимый кусок кода.
 */
public class Main {

    public static void main(String[] args) {
        // оператор
        System.out.println("Hello, world!");
    }
}
/*
1. Каждый файл java должен содержать класс.
2. Внутри класса должны быть методы.
3. Внутри методов находятся операторы.
4. Операторы - это инструкции для выполнения.
 */